# 더하기 함수 만들기
# def 함수이름(매개변수): ...
# 매개변수: 함수에 필요한 입력값 (예를 들어 숫자 2개)
# 반환값: 결과
# 함수 정의
# def add(a, b):
#     return a * b # 반환값 

# # 함수 사용 (함수 호출)
# fuc = add(7, 4)
# print('결과:', fuc)

# 인사를 출력하는 함수 만들기
# 함수의 여러가지 형태
# 입력값 없고, 반환값도 없는 함수
# def hello():
#     print('안녕하세요')

# # 함수 호출
# hello()

# # 입력값도 있고, 리턴값도 있는 함수
# # 두 수를 더하는 함수
# # 함수의 형태에 따라 호출하는 방법 알기
# def add(a, b):
#     return a + b
# # 함수를 호출할 때, 두 숫자를 입력하고
# # 호출이 끝난 후에, 결과를 받아야함
# result = add(3, 4)

# 입력값 없고, 리턴값만 있는 함수
# 인사를 반환하는 함수
# def say():
#     return 'hi'
# # 리턴 값이 있으면 결과를 받아야함
# string = say()
# print(string)

# # 입력값 있고, 반환값은 없는 함수
# # 두 수를 더하고 결과를 바로 출력하는 함수
# def add(a, b):
#     print(a + b)
# # 매개변수가 있으면 개수에 맞게 입력
# # 함수를 호출할 때는 3과 4를 '인자'라고 부른다
# add(3, 4)


